{
  "execs": [
    {
      "name": "Emily Fraser",
      "position": "President",
      "email": "emily@deca.ca",
      "phone": "519-577-7981",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3274-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3274-1024x683.jpg",
      "bio": "Emily Fraser is the President of DECA Ontario for the 2015-2016 year. Emily has been involved with DECA for her entire high school career, which she has spent as a student at Sir John A. Macdonald Secondary School in Waterloo. Last year, Emily served on the Provincial Executive Team as a Chapter Development Officer. She is is extremely passionate about DECA and cannot wait to see what DECA Ontario will accomplish this season. She hopes to make DECA Ontario the strongest it has ever been and to lead the province to a great year with her fellow Provincial Officers.\n\n\t\tAside from DECA, Emily is also highly involved in athletics and participates in ice hockey, waterskiing, skiing, field hockey and track and field. Emily is also a very active volunteer in her community. She has volunteered for the Canadian Mental Health Association and presented to over 7000 youth and community members about bringing an end to bullying. She also coaches minor girls hockey for the Waterloo Ravens. In her free time, Emily loves to meet new people, spend time with family at her cottage, and travel.\n\n\t\tEmily is incredibly excited to serve a second term on the Provincial Officer Team. As President, she cannot wait to make the 2015-2016 year another extraordinary one for DECA Ontario. Emily loves to network with new people, so if you have any questions as a student or as a community member that would like to get involved with the DECA Program, email her at emily@deca.ca or contact with her through twitter @deca_emily."
    },
    {
      "name": "Wendy Wei",
      "position": "Secretary",
      "email": "wendy@deca.ca",
      "phone": "519-780-7183",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3265-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3265-1024x683.jpg",
      "bio": "Wendy is both excited and honoured to serve as DECA Ontario’s Secretary for the upcoming school year. Wendy currently attends Centennial CVI, where she is an active member on the badminton, volleyball and tennis teams. Her favourite past times include creating music and videos, whether it’s for fun or to use as a way to inspire and connect with people. You can always find her composing music, playing the piano or editing a vlog or two in her free time. Outside of school, Wendy is also a piano teacher, a tutor, and a Student Advisor for the Ministry of Education.\n\n\t\tWendy wants to make this year’s DECA experience another success at the regional, provincial and international levels. If you have any questions, feel free to reach out to her through social media or send her an email at wendy@deca.ca."
    },
    {
      "name": "Tory Laufert",
      "position": "Media Coordinator",
      "email": "tory@deca.ca",
      "phone": "519-221-2941",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3268-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3268-1024x683.jpg",
      "bio": "Tory Laufert will be DECA Ontario’s Media Coordinator during the upcoming 2015-2016 year. Tory is a grade 12 student at Centennial CVI in Guelph, where he has been a DECA member for 3 years and has recently served as Vice President. In this role, Tory trained DECA members for success at all levels of competition and worked to generate media publicity for his chapter and its members.\n\n\t\tBeyond DECA, Tory loves technology and is an executive on his school’s robotics team. He also runs on Centennial’s track and field team and has worked frequently with the Guelph Chamber of Commerce to promote business and investment in Guelph. As hobbies, Tory loves exercising, reading about the latest ideas in the world and exploring fascinating stories through film.\n\n\t\tTory is excited to meet and connect with as many people as possible this year. Feel free to contact him with any questions, comments or ideas in person, with email at tory@deca.ca or through any of his social media accounts."
    },
    {
      "name": "Ann Chen",
      "position": "Events Coordinator",
      "email": "ann@deca.ca",
      "phone": "",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3270-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3270-1024x683.jpg",
      "bio": "Ann Chen will be one of DECA Ontario’s Event Coordinators this year. Ann is a grade 12 IB student at Victoria Park CI in Toronto and has been involved in DECA for the past three years. She has served as an executive at the Victoria Park DECA chapter, where she has also held the role of Head Principles Trainer. Ann has competed at the previous two ICDCs and has made it her goal to help more DECA Ontario members succeed at the international competition level. Ann is honoured to be a part of the DECA Ontario Executive team and is looking forward to the upcoming DECA year.\n\n\t\tAnn also aspires to become a social entrepreneur. As a result, she served as the CEO of Lattched, A Junior Achievement Company. She is also the President of her school Debate Team and a Co-Founder of Best Wishes Foundation. Previously, she worked with the Toronto Multicultural Youth Council as an Event Coordinator.\n\n\t\tIn her free time, Ann enjoys watching soccer and superhero movies. She is also the proud older sister of two siblings. Feel free to connect with her on social media or email her at ann@deca.ca."
    },
    {
      "name": "Karim El Sewedy",
      "position": "Chapter Liaison Officer",
      "email": "karim@deca.ca",
      "phone": "647-778-4877",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3262-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3262-1024x683.jpg",
      "bio": "Karim El Sewedy is thrilled to be one of DECA Ontario’s Chapter Liaison Officers. Karim is currently a Grade 12 student at Abbey Park High School in Oakville, where he is involved with Model UN, Mock Trials and Debate. He has a passion for tech-startups and nonprofit initiatives, and he currently leads organizations of his own. Karim loves to swim and read about technology, and he is particularly fond of food.\n\n\t\tThis upcoming season will be Karim’s third year in DECA. He truly believes that DECA has grown to be not just a competition, but a culture, and he encourages everyone to show their true DECA spirit. Above all, Karim is interested in connecting with as many members as he can, and hopes to continue making incredible friends through DECA. If you would like to chat or ask any questions, he encourages you to connect with him on social media or send him an email at karim@deca.ca."
    },
    {
      "name": "Christian Cutts",
      "position": "Branding & Communications Officer",
      "email": "christian@deca.ca",
      "phone": "416-709-6601",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3263-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3263-1024x683.jpg",
      "bio": "Christian Cutts is your Branding and Communications Coordinator for the 2015-2016 year. Christian hails from Toronto, where he is pursuing an International Baccalaureate Diploma at Parkdale Collegiate Institute. He has been a DECA member for the past two years and served as the Director of Training for his local chapter during the 2014-2015 year. In this role, Christian canvassed local businesses for support and built the brand equity of DECA within his local community.\n\n\t\tIn addition to DECA and academics, Christian is involved in several extracurricular activities. He serves as Co-President of Parkdale’s student council and is a runner on the school’s cross-country and track teams. Christian also volunteers with the University Health Network at Princess Margaret Hospital.\n\n\t\tIn his free time, Christian is passionate about film, running and cycling. He plans on pursuing an undergraduate degree in commerce and hopes to attain a law degree in the future. Christian takes pride in the DECA brand, and the success of the organization is akin to his own. If you have any ideas, questions or suggestions, please feel free to contact him at christian@deca.ca."
    },
    {
      "name": "Rushi Gajaria",
      "position": "Events Coordinator",
      "email": "rushi@deca.ca",
      "phone": "",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3276-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3276-1024x683.jpg",
      "bio": "Rushi Gajaria is thrilled to be one of DECA Ontario’s Event Coordinators for the upcoming year. Rushi is currently a grade 12 student enrolled in the International Business and Technology Program at Gordon Graydon Memorial Secondary School in Mississauga. He joined DECA in grade nine and has participated in three ICDC trips. At his chapter, Rushi has served as the lead of the junior executive team and as the Vice- President of Marketing.\n\n\t\tOutside of school, Rushi has been involved with Impact Tomorrow, an organization that empowers entrepreneurs, as a project manager. He would like to bring the same spirit to DECA Ontario through the entrepreneurial GRIT program. Rushi is also passionate about hockey, technology, and music. He enjoys laughing, building with LEGO, and meeting new people. Rushi is excited to meet all of DECA Ontario’s members, and he invites you all to contact him with any suggestions, feedback, or questions you may have at rushi@deca.ca."
    },
    {
      "name": "Graham Swarbrick",
      "position": "Chapter Liaison Officer",
      "email": "graham@deca.ca",
      "phone": "519-807-5585",
      "profileimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3271-300x200.jpg",
      "tallimage": "http://2016.deca.ca/wp-content/uploads/2013/03/IMG_3271-1024x683.jpg",
      "bio": "Graham Swarbrick will represent DECA Ontario as a Chapter Liaison Officer in the upcoming 2015-2016 year. Graham has been a passionate DECA competitor for the past three years at Resurrection Catholic Secondary School in Waterloo, and he looks forward to making this season the best year of DECA yet.\n\n\t\tApart from DECA, Graham is passionate about athletics and is currently a co-captain of the Resurrection Varsity Men’s Rugby Team. Graham also serves on the Resurrection Athletic Council. He loves being outdoors at his cottage, where he can be found water skiing and fishing. In his spare time, Graham enjoys reading about innovative new ideas, business startups, and marketing strategies. He also is a big fan of Canadian music and frequently attends concerts and music festivals.\n\n\t\tGraham is extremely excited to make this year memorable for all of you. Please do not hesitate to contact him via email at graham@deca.ca or through Twitter @deca_graham."
    }
  ]
}